const NAMES = [
    "لوفي", "زورو", "سانجي", "ايس", "سابو", "كيد", "ناروتو", "ساسكي", "سارادا", "بوروتو",
    "جين", "ميرويم", "غون", "كيلوا", "غوهان", "بيكولو", "فريزا", "سيل", "بيروس", "ايتادوري",
    "يوجي", "غوجو", "ساتورو", "سوكونا", "ميغومي", "توجي", "كيو", "زينيتسو", "تانجيرو", "اينوسكي",
    "نيزوكو", "غيو", "دوما", "شينوبو", "كاناو", "كاناي", "رينغوكو", "تنغن", "ابوياشيكي", "كاغايا",
    "بياكويا", "مادارا", "ايتاشي", "سونغ", "بارك", "دانيال", "غان", "غو", "فو", "شو",
    "ال", "اي", "تو", "كي", "بي", "رين", "ريو", "ايساغي", "كاراسو", "ايغو",
    "نوا", "رافينهو", "ناغي", "باتشيرا", "ساي", "هوغو", "لوكي", "باني", "زينين", "زينو",
    "دانتي", "سيلفا", "استا", "يونو", "يامي", "ويليام", "يوليوس", "فانيكا", "فانيسا", "غوثر",
    "غوش", "فريلند", "لاك", "راغنا", "فويغوليون", "ميرليونا", "ليوبولد", "نويل", "نوزيل", "لوسيفر",
    "جلجاميش", "ايزن", "اوراهارا", "ايتشيغو", "اينوي", "ايشيدا", "كون", "يوريتشي", "نامي", "يوسوب",
    "تشوبر", "روبين", "فرانكي", "بروك", "جينبي", "شانكس", "باهغي", "ميهوك", "سموكر", "كروكودايل",
    "اينيل", "دوفلامينغو", "كاتاكوري", "كابوتو", "جرايا", "تسونادي", "اوروتشيمارو", "شيكامارو", "تشوجي", "كيبا",
    "شينو", "غارا", "كانكورو", "تيماري", "ميناتو", "كوشينا", "كارين", "سويغيتسو", "جوغو", "اوبيتو",
    "كيسامي", "ساسوري", "ديدارا", "كاكوزو", "هيدان", "باين", "كونان", "زيتسو", "كوراما", "ميكاسا",
    "ارمين", "ليفاي", "اروين", "هانجي", "جان", "كوني", "ساشا", "راينر", "بيرتولت", "اندريه",
    "زيك", "فالكو", "غابي", "يلينا", "بيكسيس", "جريشا", "كارلا", "ديو", "جوتارو", "جوسكي"
];

module.exports = {
    name: '..',
    async execute({ sock, msg, from, isOwner, isNukhba }) {
        if (!isNukhba && !isOwner) return;

        const randomName = NAMES[Math.floor(Math.random() * NAMES.length)];
        
        await sock.sendMessage(from, { text: `*${randomName}*` }, { quoted: msg });
    }
};
